Pandabear1125/BuffCAN/src/imxrt1062_registers.h
#ifndef BUFFCAN_IMXRT1062_REGISTERS_HPP
#define BUFFCAN_IMXRT1062_REGISTERS_HPP

/// @file This file contains the register definitions and information for the i.MX RT1062 ARM Cortex-M7 microcontroller.

/**********\ BASE ADDRESSES /**********/
#pragma region BASE ADDRESSES

// FlexCAN BUS 1
#define FLEXCAN1_BASE_		(0x401D0000ul)
#define FLEXCAN1_MB_BASE_	(0x401D0080ul)
#define FLEXCAN1_MB_END_	(0x401D047Ful)
#define FLEXCAN1_END_		(0x401D3FFFul)

// FlexCAN BUS 2
#define FLEXCAN2_BASE_		(0x401D4000ul)
#define FLEXCAN2_MB_BASE_	(0x401D4080ul)
#define FLEXCAN2_MB_END_	(0x401D447Ful)
#define FLEXCAN2_END_		(0x401D7FFFul)

// FlexCAN BUS 3
#define FLEXCAN3_BASE_		(0x401D8000ul)
#define FLEXCAN3_MB_BASE_	(0x401D8080ul)
#define FLEXCAN3_MB_END		(0x401D847Ful)
#define FLEXCAN3_END_		(0x401DBFFFul)

#pragma endregion // BASE ADDRESSES

/**********\ BASE REGISTERS /**********/
#pragma region BASE REGISTERS

//// FlexCAN BUS 1

// Module Configuration Register (R/W)
#define FLEXCAN1_MCR_		(FLEXCAN1_BASE_ + 0x0000ul)
// Control 1 Register (R/W)
#define FLEXCAN1_CTRL1_		(FLEXCAN1_BASE_ + 0x0004ul)
// Free Running Timer Register (R/W)
#define FLEXCAN1_TIMER_		(FLEXCAN1_BASE_ + 0x0008ul)
// Receiving Mailboxes Global Mask Register (R/W)
#define FLEXCAN1_RXMGMASK_	(FLEXCAN1_BASE_ + 0x0010ul)
// Receiving Buffer 14 Mask Register (R/W)
#define FLEXCAN1_RX14MASK_	(FLEXCAN1_BASE_ + 0x0014ul)
// Receiving Buffer 15 Mask Register (R/W)
#define FLEXCAN1_RX15MASK_	(FLEXCAN1_BASE_ + 0x0018ul)
// Error Counter Register (R/W)
#define FLEXCAN1_ECR_		(FLEXCAN1_BASE_ + 0x001Cul)
// Error and Status 1 Register (R/W)
#define FLEXCAN1_ESR1_		(FLEXCAN1_BASE_ + 0x0020ul)
// Interrupt Masks 2 Register (R/W)
#define FLEXCAN1_IMASK2_	(FLEXCAN1_BASE_ + 0x0024ul)
// Interrupt Masks 1 Register (R/W)
#define FLEXCAN1_IMASK1_	(FLEXCAN1_BASE_ + 0x0028ul)
// Interrupt Flags 2 Register (R/W)
#define FLEXCAN1_IFLAG2_	(FLEXCAN1_BASE_ + 0x002Cul)
// Interrupt Flags 1 Register (R/W)
#define FLEXCAN1_IFLAG1_	(FLEXCAN1_BASE_ + 0x0030ul)
// Control 2 Register (R/W)
#define FLEXCAN1_CTRL2_		(FLEXCAN1_BASE_ + 0x0034ul)
// Error and Status 2 Register (Read Only)
#define FLEXCAN1_ESR2_		(FLEXCAN1_BASE_ + 0x0038ul)
// CRC Register (Read Only)
#define FLEXCAN1_CRCR_		(FLEXCAN1_BASE_ + 0x0044ul)
// Receiving FIFO Global Mask Register (R/W)
#define FLEXCAN1_RXFGMASK_	(FLEXCAN1_BASE_ + 0x0048ul)
// Receiving FIFO Information Register (Read Only)
#define FLEXCAN1_RXFIR_		(FLEXCAN1_BASE_ + 0x004Cul)
// Debug 1 Register (Read Only)
#define FLEXCAN1_DBG1_		(FLEXCAN1_BASE_ + 0x0058ul)
// Debug 2 Register (Read Only)
#define FLEXCAN1_DBG2_		(FLEXCAN1_BASE_ + 0x005Cul)

// Individual Message Buffers  (R/W)
#define FLEXCAN1_MBx(x)		(FLEXCAN1_MB_BASE_ +(x * 0x10ul))

#define FLEXCAN1_MB0_		(FLEXCAN1_MB_BASE_ + 0x0000ul)
#define FLEXCAN1_MB1_		(FLEXCAN1_MB_BASE_ + 0x0010ul)
#define FLEXCAN1_MB2_		(FLEXCAN1_MB_BASE_ + 0x0020ul)
#define FLEXCAN1_MB3_		(FLEXCAN1_MB_BASE_ + 0x0030ul)
#define FLEXCAN1_MB4_		(FLEXCAN1_MB_BASE_ + 0x0040ul)
#define FLEXCAN1_MB5_		(FLEXCAN1_MB_BASE_ + 0x0050ul)
#define FLEXCAN1_MB6_		(FLEXCAN1_MB_BASE_ + 0x0060ul)
#define FLEXCAN1_MB7_		(FLEXCAN1_MB_BASE_ + 0x0070ul)
#define FLEXCAN1_MB8_		(FLEXCAN1_MB_BASE_ + 0x0080ul)
#define FLEXCAN1_MB9_		(FLEXCAN1_MB_BASE_ + 0x0090ul)
#define FLEXCAN1_MB10_		(FLEXCAN1_MB_BASE_ + 0x00A0ul)
#define FLEXCAN1_MB11_		(FLEXCAN1_MB_BASE_ + 0x00B0ul)
#define FLEXCAN1_MB12_		(FLEXCAN1_MB_BASE_ + 0x00C0ul)
#define FLEXCAN1_MB13_		(FLEXCAN1_MB_BASE_ + 0x00D0ul)
#define FLEXCAN1_MB14_		(FLEXCAN1_MB_BASE_ + 0x00E0ul)
#define FLEXCAN1_MB15_		(FLEXCAN1_MB_BASE_ + 0x00F0ul)
#define FLEXCAN1_MB16_		(FLEXCAN1_MB_BASE_ + 0x0100ul)
#define FLEXCAN1_MB17_		(FLEXCAN1_MB_BASE_ + 0x0110ul)
#define FLEXCAN1_MB18_		(FLEXCAN1_MB_BASE_ + 0x0120ul)
#define FLEXCAN1_MB19_		(FLEXCAN1_MB_BASE_ + 0x0130ul)
#define FLEXCAN1_MB20_		(FLEXCAN1_MB_BASE_ + 0x0140ul)
#define FLEXCAN1_MB21_		(FLEXCAN1_MB_BASE_ + 0x0150ul)
#define FLEXCAN1_MB22_		(FLEXCAN1_MB_BASE_ + 0x0160ul)
#define FLEXCAN1_MB23_		(FLEXCAN1_MB_BASE_ + 0x0170ul)
#define FLEXCAN1_MB24_		(FLEXCAN1_MB_BASE_ + 0x0180ul)
#define FLEXCAN1_MB25_		(FLEXCAN1_MB_BASE_ + 0x0190ul)
#define FLEXCAN1_MB26_		(FLEXCAN1_MB_BASE_ + 0x01A0ul)
#define FLEXCAN1_MB27_		(FLEXCAN1_MB_BASE_ + 0x01B0ul)
#define FLEXCAN1_MB28_		(FLEXCAN1_MB_BASE_ + 0x01C0ul)
#define FLEXCAN1_MB29_		(FLEXCAN1_MB_BASE_ + 0x01D0ul)
#define FLEXCAN1_MB30_		(FLEXCAN1_MB_BASE_ + 0x01E0ul)
#define FLEXCAN1_MB31_		(FLEXCAN1_MB_BASE_ + 0x01F0ul)
#define FLEXCAN1_MB32_		(FLEXCAN1_MB_BASE_ + 0x0200ul)
#define FLEXCAN1_MB33_		(FLEXCAN1_MB_BASE_ + 0x0210ul)
#define FLEXCAN1_MB34_		(FLEXCAN1_MB_BASE_ + 0x0220ul)
#define FLEXCAN1_MB35_		(FLEXCAN1_MB_BASE_ + 0x0230ul)
#define FLEXCAN1_MB36_		(FLEXCAN1_MB_BASE_ + 0x0240ul)
#define FLEXCAN1_MB37_		(FLEXCAN1_MB_BASE_ + 0x0250ul)
#define FLEXCAN1_MB38_		(FLEXCAN1_MB_BASE_ + 0x0260ul)
#define FLEXCAN1_MB39_		(FLEXCAN1_MB_BASE_ + 0x0270ul)
#define FLEXCAN1_MB40_		(FLEXCAN1_MB_BASE_ + 0x0280ul)
#define FLEXCAN1_MB41_		(FLEXCAN1_MB_BASE_ + 0x0290ul)
#define FLEXCAN1_MB42_		(FLEXCAN1_MB_BASE_ + 0x02A0ul)
#define FLEXCAN1_MB43_		(FLEXCAN1_MB_BASE_ + 0x02B0ul)
#define FLEXCAN1_MB44_		(FLEXCAN1_MB_BASE_ + 0x02C0ul)
#define FLEXCAN1_MB45_		(FLEXCAN1_MB_BASE_ + 0x02D0ul)
#define FLEXCAN1_MB46_		(FLEXCAN1_MB_BASE_ + 0x02E0ul)
#define FLEXCAN1_MB47_		(FLEXCAN1_MB_BASE_ + 0x02F0ul)
#define FLEXCAN1_MB48_		(FLEXCAN1_MB_BASE_ + 0x0300ul)
#define FLEXCAN1_MB49_		(FLEXCAN1_MB_BASE_ + 0x0310ul)
#define FLEXCAN1_MB50_		(FLEXCAN1_MB_BASE_ + 0x0320ul)
#define FLEXCAN1_MB51_		(FLEXCAN1_MB_BASE_ + 0x0330ul)
#define FLEXCAN1_MB52_		(FLEXCAN1_MB_BASE_ + 0x0340ul)
#define FLEXCAN1_MB53_		(FLEXCAN1_MB_BASE_ + 0x0350ul)
#define FLEXCAN1_MB54_		(FLEXCAN1_MB_BASE_ + 0x0360ul)
#define FLEXCAN1_MB55_		(FLEXCAN1_MB_BASE_ + 0x0370ul)
#define FLEXCAN1_MB56_		(FLEXCAN1_MB_BASE_ + 0x0380ul)
#define FLEXCAN1_MB57_		(FLEXCAN1_MB_BASE_ + 0x0390ul)
#define FLEXCAN1_MB58_		(FLEXCAN1_MB_BASE_ + 0x03A0ul)
#define FLEXCAN1_MB59_		(FLEXCAN1_MB_BASE_ + 0x03B0ul)
#define FLEXCAN1_MB60_		(FLEXCAN1_MB_BASE_ + 0x03C0ul)
#define FLEXCAN1_MB61_		(FLEXCAN1_MB_BASE_ + 0x03D0ul)
#define FLEXCAN1_MB62_		(FLEXCAN1_MB_BASE_ + 0x03E0ul)
#define FLEXCAN1_MB63_		(FLEXCAN1_MB_BASE_ + 0x03F0ul)

// Receiving Individual Mask Registers  (R/W)
#define FLEXCAN1_RXIMRx(x)	(FLEXCAN1_BASE_ + 0x0880ul +(x * 0x4ul))

#define FLEXCAN1_RXIMR0_	(FLEXCAN1_BASE_ + 0x0880ul)
#define FLEXCAN1_RXIMR1_	(FLEXCAN1_BASE_ + 0x0884ul)
#define FLEXCAN1_RXIMR2_	(FLEXCAN1_BASE_ + 0x0888ul)
#define FLEXCAN1_RXIMR3_	(FLEXCAN1_BASE_ + 0x088Cul)
#define FLEXCAN1_RXIMR4_	(FLEXCAN1_BASE_ + 0x0890ul)
#define FLEXCAN1_RXIMR5_	(FLEXCAN1_BASE_ + 0x0894ul)
#define FLEXCAN1_RXIMR6_	(FLEXCAN1_BASE_ + 0x0898ul)
#define FLEXCAN1_RXIMR7_	(FLEXCAN1_BASE_ + 0x089Cul)
#define FLEXCAN1_RXIMR8_	(FLEXCAN1_BASE_ + 0x08A0ul)
#define FLEXCAN1_RXIMR9_	(FLEXCAN1_BASE_ + 0x08A4ul)
#define FLEXCAN1_RXIMR10_	(FLEXCAN1_BASE_ + 0x08A8ul)
#define FLEXCAN1_RXIMR11_	(FLEXCAN1_BASE_ + 0x08ACul)
#define FLEXCAN1_RXIMR12_	(FLEXCAN1_BASE_ + 0x08B0ul)
#define FLEXCAN1_RXIMR13_	(FLEXCAN1_BASE_ + 0x08B4ul)
#define FLEXCAN1_RXIMR14_	(FLEXCAN1_BASE_ + 0x08B8ul)
#define FLEXCAN1_RXIMR15_	(FLEXCAN1_BASE_ + 0x08BCul)
#define FLEXCAN1_RXIMR16_	(FLEXCAN1_BASE_ + 0x08C0ul)
#define FLEXCAN1_RXIMR17_	(FLEXCAN1_BASE_ + 0x08C4ul)
#define FLEXCAN1_RXIMR18_	(FLEXCAN1_BASE_ + 0x08C8ul)
#define FLEXCAN1_RXIMR19_	(FLEXCAN1_BASE_ + 0x08CCul)
#define FLEXCAN1_RXIMR20_	(FLEXCAN1_BASE_ + 0x08D0ul)
#define FLEXCAN1_RXIMR21_	(FLEXCAN1_BASE_ + 0x08D4ul)
#define FLEXCAN1_RXIMR22_	(FLEXCAN1_BASE_ + 0x08D8ul)
#define FLEXCAN1_RXIMR23_	(FLEXCAN1_BASE_ + 0x08DCul)
#define FLEXCAN1_RXIMR24_	(FLEXCAN1_BASE_ + 0x08E0ul)
#define FLEXCAN1_RXIMR25_	(FLEXCAN1_BASE_ + 0x08E4ul)
#define FLEXCAN1_RXIMR26_	(FLEXCAN1_BASE_ + 0x08E8ul)
#define FLEXCAN1_RXIMR27_	(FLEXCAN1_BASE_ + 0x08ECul)
#define FLEXCAN1_RXIMR28_	(FLEXCAN1_BASE_ + 0x08F0ul)
#define FLEXCAN1_RXIMR29_	(FLEXCAN1_BASE_ + 0x08F4ul)
#define FLEXCAN1_RXIMR30_	(FLEXCAN1_BASE_ + 0x08F8ul)
#define FLEXCAN1_RXIMR31_	(FLEXCAN1_BASE_ + 0x08FCul)
#define FLEXCAN1_RXIMR32_	(FLEXCAN1_BASE_ + 0x0900ul)
#define FLEXCAN1_RXIMR33_	(FLEXCAN1_BASE_ + 0x0904ul)
#define FLEXCAN1_RXIMR34_	(FLEXCAN1_BASE_ + 0x0908ul)
#define FLEXCAN1_RXIMR35_	(FLEXCAN1_BASE_ + 0x090Cul)
#define FLEXCAN1_RXIMR36_	(FLEXCAN1_BASE_ + 0x0910ul)
#define FLEXCAN1_RXIMR37_	(FLEXCAN1_BASE_ + 0x0914ul)
#define FLEXCAN1_RXIMR38_	(FLEXCAN1_BASE_ + 0x0918ul)
#define FLEXCAN1_RXIMR39_	(FLEXCAN1_BASE_ + 0x091Cul)
#define FLEXCAN1_RXIMR40_	(FLEXCAN1_BASE_ + 0x0920ul)
#define FLEXCAN1_RXIMR41_	(FLEXCAN1_BASE_ + 0x0924ul)
#define FLEXCAN1_RXIMR42_	(FLEXCAN1_BASE_ + 0x0928ul)
#define FLEXCAN1_RXIMR43_	(FLEXCAN1_BASE_ + 0x092Cul)
#define FLEXCAN1_RXIMR44_	(FLEXCAN1_BASE_ + 0x0930ul)
#define FLEXCAN1_RXIMR45_	(FLEXCAN1_BASE_ + 0x0934ul)
#define FLEXCAN1_RXIMR46_	(FLEXCAN1_BASE_ + 0x0938ul)
#define FLEXCAN1_RXIMR47_	(FLEXCAN1_BASE_ + 0x093Cul)
#define FLEXCAN1_RXIMR48_	(FLEXCAN1_BASE_ + 0x0940ul)
#define FLEXCAN1_RXIMR49_	(FLEXCAN1_BASE_ + 0x0944ul)
#define FLEXCAN1_RXIMR50_	(FLEXCAN1_BASE_ + 0x0948ul)
#define FLEXCAN1_RXIMR51_	(FLEXCAN1_BASE_ + 0x094Cul)
#define FLEXCAN1_RXIMR52_	(FLEXCAN1_BASE_ + 0x0950ul)
#define FLEXCAN1_RXIMR53_	(FLEXCAN1_BASE_ + 0x0954ul)
#define FLEXCAN1_RXIMR54_	(FLEXCAN1_BASE_ + 0x0958ul)
#define FLEXCAN1_RXIMR55_	(FLEXCAN1_BASE_ + 0x095Cul)
#define FLEXCAN1_RXIMR56_	(FLEXCAN1_BASE_ + 0x0960ul)
#define FLEXCAN1_RXIMR57_	(FLEXCAN1_BASE_ + 0x0964ul)
#define FLEXCAN1_RXIMR58_	(FLEXCAN1_BASE_ + 0x0968ul)
#define FLEXCAN1_RXIMR59_	(FLEXCAN1_BASE_ + 0x096Cul)
#define FLEXCAN1_RXIMR60_	(FLEXCAN1_BASE_ + 0x0970ul)
#define FLEXCAN1_RXIMR61_	(FLEXCAN1_BASE_ + 0x0974ul)
#define FLEXCAN1_RXIMR62_	(FLEXCAN1_BASE_ + 0x0978ul)
#define FLEXCAN1_RXIMR63_	(FLEXCAN1_BASE_ + 0x097Cul)

// Glitch Filter Width Register (R/W)
#define FLEXCAN1_GFWR_		(FLEXCAN1_BASE_ + 0x09E0ul)

//// FlexCAN BUS 2

