Pandabear1125/BuffCAN/src/imxrt1062_registers.h
// Module Configuration Register (R/W)
#define FLEXCAN2_MCR_		(FLEXCAN2_BASE_ + 0x0000ul)
// Control 1 Register (R/W)
#define FLEXCAN2_CTRL1_		(FLEXCAN2_BASE_ + 0x0004ul)
// Free Running Timer Register (R/W)
#define FLEXCAN2_TIMER_		(FLEXCAN2_BASE_ + 0x0008ul)
// Receiving Mailboxes Global Mask Register (R/W)
#define FLEXCAN2_RXMGMASK_	(FLEXCAN2_BASE_ + 0x0010ul)
// Receiving Buffer 14 Mask Register (R/W)
#define FLEXCAN2_RX14MASK_	(FLEXCAN2_BASE_ + 0x0014ul)
// Receiving Buffer 15 Mask Register (R/W)
#define FLEXCAN2_RX15MASK_	(FLEXCAN2_BASE_ + 0x0018ul)
// Error Counter Register (R/W)
#define FLEXCAN2_ECR_		(FLEXCAN2_BASE_ + 0x001Cul)
// Error and Status 1 Register (R/W)
#define FLEXCAN2_ESR1_		(FLEXCAN2_BASE_ + 0x0020ul)
// Interrupt Masks 2 Register (R/W)
#define FLEXCAN2_IMASK2_	(FLEXCAN2_BASE_ + 0x0024ul)
// Interrupt Masks 1 Register (R/W)
#define FLEXCAN2_IMASK1_	(FLEXCAN2_BASE_ + 0x0028ul)
// Interrupt Flags 2 Register (R/W)
#define FLEXCAN2_IFLAG2_	(FLEXCAN2_BASE_ + 0x002Cul)
// Interrupt Flags 1 Register (R/W)
#define FLEXCAN2_IFLAG1_	(FLEXCAN2_BASE_ + 0x0030ul)
// Control 2 Register (R/W)
#define FLEXCAN2_CTRL2_		(FLEXCAN2_BASE_ + 0x0034ul)
// Error and Status 2 Register (Read Only)
#define FLEXCAN2_ESR2_		(FLEXCAN2_BASE_ + 0x0038ul)
// CRC Register (Read Only)
#define FLEXCAN2_CRCR_		(FLEXCAN2_BASE_ + 0x0044ul)
// Receiving FIFO Global Mask Register (R/W)
#define FLEXCAN2_RXFGMASK_	(FLEXCAN2_BASE_ + 0x0048ul)
// Receiving FIFO Information Register (Read Only)
#define FLEXCAN2_RXFIR_		(FLEXCAN2_BASE_ + 0x004Cul)
// Debug 1 Register (Read Only)
#define FLEXCAN2_DBG1_		(FLEXCAN2_BASE_ + 0x0058ul)
// Debug 2 Register (Read Only)
#define FLEXCAN2_DBG2_		(FLEXCAN2_BASE_ + 0x005Cul)

// Individual Message Buffers  (R/W)
#define FLEXCAN2_MBx(x)		(FLEXCAN2_MB_BASE_ +(x * 0x10ul))

#define FLEXCAN2_MB0_		(FLEXCAN2_MB_BASE_ + 0x0000ul)
#define FLEXCAN2_MB1_		(FLEXCAN2_MB_BASE_ + 0x0010ul)
#define FLEXCAN2_MB2_		(FLEXCAN2_MB_BASE_ + 0x0020ul)
#define FLEXCAN2_MB3_		(FLEXCAN2_MB_BASE_ + 0x0030ul)
#define FLEXCAN2_MB4_		(FLEXCAN2_MB_BASE_ + 0x0040ul)
#define FLEXCAN2_MB5_		(FLEXCAN2_MB_BASE_ + 0x0050ul)
#define FLEXCAN2_MB6_		(FLEXCAN2_MB_BASE_ + 0x0060ul)
#define FLEXCAN2_MB7_		(FLEXCAN2_MB_BASE_ + 0x0070ul)
#define FLEXCAN2_MB8_		(FLEXCAN2_MB_BASE_ + 0x0080ul)
#define FLEXCAN2_MB9_		(FLEXCAN2_MB_BASE_ + 0x0090ul)
#define FLEXCAN2_MB10_		(FLEXCAN2_MB_BASE_ + 0x00A0ul)
#define FLEXCAN2_MB11_		(FLEXCAN2_MB_BASE_ + 0x00B0ul)
#define FLEXCAN2_MB12_		(FLEXCAN2_MB_BASE_ + 0x00C0ul)
#define FLEXCAN2_MB13_		(FLEXCAN2_MB_BASE_ + 0x00D0ul)
#define FLEXCAN2_MB14_		(FLEXCAN2_MB_BASE_ + 0x00E0ul)
#define FLEXCAN2_MB15_		(FLEXCAN2_MB_BASE_ + 0x00F0ul)
#define FLEXCAN2_MB16_		(FLEXCAN2_MB_BASE_ + 0x0100ul)
#define FLEXCAN2_MB17_		(FLEXCAN2_MB_BASE_ + 0x0110ul)
#define FLEXCAN2_MB18_		(FLEXCAN2_MB_BASE_ + 0x0120ul)
#define FLEXCAN2_MB19_		(FLEXCAN2_MB_BASE_ + 0x0130ul)
#define FLEXCAN2_MB20_		(FLEXCAN2_MB_BASE_ + 0x0140ul)
#define FLEXCAN2_MB21_		(FLEXCAN2_MB_BASE_ + 0x0150ul)
#define FLEXCAN2_MB22_		(FLEXCAN2_MB_BASE_ + 0x0160ul)
#define FLEXCAN2_MB23_		(FLEXCAN2_MB_BASE_ + 0x0170ul)
#define FLEXCAN2_MB24_		(FLEXCAN2_MB_BASE_ + 0x0180ul)
#define FLEXCAN2_MB25_		(FLEXCAN2_MB_BASE_ + 0x0190ul)
#define FLEXCAN2_MB26_		(FLEXCAN2_MB_BASE_ + 0x01A0ul)
#define FLEXCAN2_MB27_		(FLEXCAN2_MB_BASE_ + 0x01B0ul)
#define FLEXCAN2_MB28_		(FLEXCAN2_MB_BASE_ + 0x01C0ul)
#define FLEXCAN2_MB29_		(FLEXCAN2_MB_BASE_ + 0x01D0ul)
#define FLEXCAN2_MB30_		(FLEXCAN2_MB_BASE_ + 0x01E0ul)
#define FLEXCAN2_MB31_		(FLEXCAN2_MB_BASE_ + 0x01F0ul)
#define FLEXCAN2_MB32_		(FLEXCAN2_MB_BASE_ + 0x0200ul)
#define FLEXCAN2_MB33_		(FLEXCAN2_MB_BASE_ + 0x0210ul)
#define FLEXCAN2_MB34_		(FLEXCAN2_MB_BASE_ + 0x0220ul)
#define FLEXCAN2_MB35_		(FLEXCAN2_MB_BASE_ + 0x0230ul)
#define FLEXCAN2_MB36_		(FLEXCAN2_MB_BASE_ + 0x0240ul)
#define FLEXCAN2_MB37_		(FLEXCAN2_MB_BASE_ + 0x0250ul)
#define FLEXCAN2_MB38_		(FLEXCAN2_MB_BASE_ + 0x0260ul)
#define FLEXCAN2_MB39_		(FLEXCAN2_MB_BASE_ + 0x0270ul)
#define FLEXCAN2_MB40_		(FLEXCAN2_MB_BASE_ + 0x0280ul)
#define FLEXCAN2_MB41_		(FLEXCAN2_MB_BASE_ + 0x0290ul)
#define FLEXCAN2_MB42_		(FLEXCAN2_MB_BASE_ + 0x02A0ul)
#define FLEXCAN2_MB43_		(FLEXCAN2_MB_BASE_ + 0x02B0ul)
#define FLEXCAN2_MB44_		(FLEXCAN2_MB_BASE_ + 0x02C0ul)
#define FLEXCAN2_MB45_		(FLEXCAN2_MB_BASE_ + 0x02D0ul)
#define FLEXCAN2_MB46_		(FLEXCAN2_MB_BASE_ + 0x02E0ul)
#define FLEXCAN2_MB47_		(FLEXCAN2_MB_BASE_ + 0x02F0ul)
#define FLEXCAN2_MB48_		(FLEXCAN2_MB_BASE_ + 0x0300ul)
#define FLEXCAN2_MB49_		(FLEXCAN2_MB_BASE_ + 0x0310ul)
#define FLEXCAN2_MB50_		(FLEXCAN2_MB_BASE_ + 0x0320ul)
#define FLEXCAN2_MB51_		(FLEXCAN2_MB_BASE_ + 0x0330ul)
#define FLEXCAN2_MB52_		(FLEXCAN2_MB_BASE_ + 0x0340ul)
#define FLEXCAN2_MB53_		(FLEXCAN2_MB_BASE_ + 0x0350ul)
#define FLEXCAN2_MB54_		(FLEXCAN2_MB_BASE_ + 0x0360ul)
#define FLEXCAN2_MB55_		(FLEXCAN2_MB_BASE_ + 0x0370ul)
#define FLEXCAN2_MB56_		(FLEXCAN2_MB_BASE_ + 0x0380ul)
#define FLEXCAN2_MB57_		(FLEXCAN2_MB_BASE_ + 0x0390ul)
#define FLEXCAN2_MB58_		(FLEXCAN2_MB_BASE_ + 0x03A0ul)
#define FLEXCAN2_MB59_		(FLEXCAN2_MB_BASE_ + 0x03B0ul)
#define FLEXCAN2_MB60_		(FLEXCAN2_MB_BASE_ + 0x03C0ul)
#define FLEXCAN2_MB61_		(FLEXCAN2_MB_BASE_ + 0x03D0ul)
#define FLEXCAN2_MB62_		(FLEXCAN2_MB_BASE_ + 0x03E0ul)
#define FLEXCAN2_MB63_		(FLEXCAN2_MB_BASE_ + 0x03F0ul)

// Receiving Individual Mask Registers  (R/W)
#define FLEXCAN2_RXIMRx(x)	(FLEXCAN2_BASE_ + 0x0880ul +(x * 0x4ul))

#define FLEXCAN2_RXIMR0_	(FLEXCAN2_BASE_ + 0x0880ul)
#define FLEXCAN2_RXIMR1_	(FLEXCAN2_BASE_ + 0x0884ul)
#define FLEXCAN2_RXIMR2_	(FLEXCAN2_BASE_ + 0x0888ul)
#define FLEXCAN2_RXIMR3_	(FLEXCAN2_BASE_ + 0x088Cul)
#define FLEXCAN2_RXIMR4_	(FLEXCAN2_BASE_ + 0x0890ul)
#define FLEXCAN2_RXIMR5_	(FLEXCAN2_BASE_ + 0x0894ul)
#define FLEXCAN2_RXIMR6_	(FLEXCAN2_BASE_ + 0x0898ul)
#define FLEXCAN2_RXIMR7_	(FLEXCAN2_BASE_ + 0x089Cul)
#define FLEXCAN2_RXIMR8_	(FLEXCAN2_BASE_ + 0x08A0ul)
#define FLEXCAN2_RXIMR9_	(FLEXCAN2_BASE_ + 0x08A4ul)
#define FLEXCAN2_RXIMR10_	(FLEXCAN2_BASE_ + 0x08A8ul)
#define FLEXCAN2_RXIMR11_	(FLEXCAN2_BASE_ + 0x08ACul)
#define FLEXCAN2_RXIMR12_	(FLEXCAN2_BASE_ + 0x08B0ul)
#define FLEXCAN2_RXIMR13_	(FLEXCAN2_BASE_ + 0x08B4ul)
#define FLEXCAN2_RXIMR14_	(FLEXCAN2_BASE_ + 0x08B8ul)
#define FLEXCAN2_RXIMR15_	(FLEXCAN2_BASE_ + 0x08BCul)
#define FLEXCAN2_RXIMR16_	(FLEXCAN2_BASE_ + 0x08C0ul)
#define FLEXCAN2_RXIMR17_	(FLEXCAN2_BASE_ + 0x08C4ul)
#define FLEXCAN2_RXIMR18_	(FLEXCAN2_BASE_ + 0x08C8ul)
#define FLEXCAN2_RXIMR19_	(FLEXCAN2_BASE_ + 0x08CCul)
#define FLEXCAN2_RXIMR20_	(FLEXCAN2_BASE_ + 0x08D0ul)
#define FLEXCAN2_RXIMR21_	(FLEXCAN2_BASE_ + 0x08D4ul)
#define FLEXCAN2_RXIMR22_	(FLEXCAN2_BASE_ + 0x08D8ul)
#define FLEXCAN2_RXIMR23_	(FLEXCAN2_BASE_ + 0x08DCul)
#define FLEXCAN2_RXIMR24_	(FLEXCAN2_BASE_ + 0x08E0ul)
#define FLEXCAN2_RXIMR25_	(FLEXCAN2_BASE_ + 0x08E4ul)
#define FLEXCAN2_RXIMR26_	(FLEXCAN2_BASE_ + 0x08E8ul)
#define FLEXCAN2_RXIMR27_	(FLEXCAN2_BASE_ + 0x08ECul)
#define FLEXCAN2_RXIMR28_	(FLEXCAN2_BASE_ + 0x08F0ul)
#define FLEXCAN2_RXIMR29_	(FLEXCAN2_BASE_ + 0x08F4ul)
#define FLEXCAN2_RXIMR30_	(FLEXCAN2_BASE_ + 0x08F8ul)
#define FLEXCAN2_RXIMR31_	(FLEXCAN2_BASE_ + 0x08FCul)
#define FLEXCAN2_RXIMR32_	(FLEXCAN2_BASE_ + 0x0900ul)
#define FLEXCAN2_RXIMR33_	(FLEXCAN2_BASE_ + 0x0904ul)
#define FLEXCAN2_RXIMR34_	(FLEXCAN2_BASE_ + 0x0908ul)
#define FLEXCAN2_RXIMR35_	(FLEXCAN2_BASE_ + 0x090Cul)
#define FLEXCAN2_RXIMR36_	(FLEXCAN2_BASE_ + 0x0910ul)
#define FLEXCAN2_RXIMR37_	(FLEXCAN2_BASE_ + 0x0914ul)
#define FLEXCAN2_RXIMR38_	(FLEXCAN2_BASE_ + 0x0918ul)
#define FLEXCAN2_RXIMR39_	(FLEXCAN2_BASE_ + 0x091Cul)
#define FLEXCAN2_RXIMR40_	(FLEXCAN2_BASE_ + 0x0920ul)
#define FLEXCAN2_RXIMR41_	(FLEXCAN2_BASE_ + 0x0924ul)
#define FLEXCAN2_RXIMR42_	(FLEXCAN2_BASE_ + 0x0928ul)
#define FLEXCAN2_RXIMR43_	(FLEXCAN2_BASE_ + 0x092Cul)
#define FLEXCAN2_RXIMR44_	(FLEXCAN2_BASE_ + 0x0930ul)
#define FLEXCAN2_RXIMR45_	(FLEXCAN2_BASE_ + 0x0934ul)
#define FLEXCAN2_RXIMR46_	(FLEXCAN2_BASE_ + 0x0938ul)
#define FLEXCAN2_RXIMR47_	(FLEXCAN2_BASE_ + 0x093Cul)
#define FLEXCAN2_RXIMR48_	(FLEXCAN2_BASE_ + 0x0940ul)
#define FLEXCAN2_RXIMR49_	(FLEXCAN2_BASE_ + 0x0944ul)
#define FLEXCAN2_RXIMR50_	(FLEXCAN2_BASE_ + 0x0948ul)
#define FLEXCAN2_RXIMR51_	(FLEXCAN2_BASE_ + 0x094Cul)
#define FLEXCAN2_RXIMR52_	(FLEXCAN2_BASE_ + 0x0950ul)
#define FLEXCAN2_RXIMR53_	(FLEXCAN2_BASE_ + 0x0954ul)
#define FLEXCAN2_RXIMR54_	(FLEXCAN2_BASE_ + 0x0958ul)
#define FLEXCAN2_RXIMR55_	(FLEXCAN2_BASE_ + 0x095Cul)
#define FLEXCAN2_RXIMR56_	(FLEXCAN2_BASE_ + 0x0960ul)
#define FLEXCAN2_RXIMR57_	(FLEXCAN2_BASE_ + 0x0964ul)
#define FLEXCAN2_RXIMR58_	(FLEXCAN2_BASE_ + 0x0968ul)
#define FLEXCAN2_RXIMR59_	(FLEXCAN2_BASE_ + 0x096Cul)
#define FLEXCAN2_RXIMR60_	(FLEXCAN2_BASE_ + 0x0970ul)
#define FLEXCAN2_RXIMR61_	(FLEXCAN2_BASE_ + 0x0974ul)
#define FLEXCAN2_RXIMR62_	(FLEXCAN2_BASE_ + 0x0978ul)
#define FLEXCAN2_RXIMR63_	(FLEXCAN2_BASE_ + 0x097Cul)

// Glitch Filter Width Register (R/W)
#define FLEXCAN2_GFWR_		(FLEXCAN2_BASE_ + 0x09E0ul)

