Pandabear1125/BuffCAN/src/imxrt1062_registers.h
//// FlexCAN BUS 3

// Module Configuration Register (R/W)
#define FLEXCAN3_MCR_		(FLEXCAN3_BASE_ + 0x0000ul)
// Control 1 Register (R/W)
#define FLEXCAN3_CTRL1_		(FLEXCAN3_BASE_ + 0x0004ul)
// Free Running Timer Register (R/W)
#define FLEXCAN3_TIMER_		(FLEXCAN3_BASE_ + 0x0008ul)
// Receiving Mailboxes Global Mask Register (R/W)
#define FLEXCAN3_RXMGMASK_	(FLEXCAN3_BASE_ + 0x0010ul)
// Receiving 14 Mask Register (R/W)
#define FLEXCAN3_RX14MASK_	(FLEXCAN3_BASE_ + 0x0014ul)
// Receiving 15 Mask Register (R/W)
#define FLEXCAN3_RX15MASK_	(FLEXCAN3_BASE_ + 0x0018ul)
// Error Counter (R/W)
#define FLEXCAN3_ECR_		(FLEXCAN3_BASE_ + 0x001Cul)
// Error and Status 1 Register (Read Clears Register)
#define FLEXCAN3_ESR1_		(FLEXCAN3_BASE_ + 0x0020ul)
// Interrupt Mask 2 Register (R/W)
#define FLEXCAN3_IMASK2_	(FLEXCAN3_BASE_ + 0x0024ul)
// Interrupt Mask 1 Register (R/W)
#define FLEXCAN3_IMASK1_	(FLEXCAN3_BASE_ + 0x0028ul)
// Interrupt Flags 2 Register (R/W - Write 1s to clear)
#define FLEXCAN3_IFLAG2_	(FLEXCAN3_BASE_ + 0x002Cul)
// Interrupt Flags 1 Register (R/W - Write 1s to clear)
#define FLEXCAN3_IFLAG1_	(FLEXCAN3_BASE_ + 0x0030ul)
// Control 2 Register (R/W)
#define FLEXCAN3_CTRL2_		(FLEXCAN3_BASE_ + 0x0034ul)
// Error and Status 2 Register (Read Only)
#define FLEXCAN3_ESR2_		(FLEXCAN3_BASE_ + 0x0038ul)
// CRC Register (Read Only)
#define FLEXCAN3_CRCR_		(FLEXCAN3_BASE_ + 0x0044ul)
// Receiving FIFO Global Mask Register (R/W)
#define FLEXCAN3_RXFGMASK_	(FLEXCAN3_BASE_ + 0x0048ul)
// Receiving FIFO Information Register (Read Only)
#define FLEXCAN3_RXFIR_		(FLEXCAN3_BASE_ + 0x004Cul)
// CAN Bit Timing Register (R/W)
#define FLEXCAN3_CBT_		(FLEXCAN3_BASE_ + 0x0050ul)

// Individual Message Buffers  (R/W)
#define FLEXCAN3_NUM_8B_MB_	(64ul)
#define FLEXCAN3_8B_MBx(x)	(FLEXCAN3_MB_BASE_ +(x * 0x10ul))
#define FLEXCAN3_NUM_16B_MB_ (42ul)
#define FLEXCAN3_16B_MBx(x)	(FLEXCAN3_MB_BASE_ +(x * 0x18ul))
#define FLEXCAN3_NUM_32B_MB_	(24ul)
#define FLEXCAN3_32B_MBx(x)	(FLEXCAN3_MB_BASE_ +(x * 0x28ul))
#define FLEXCAN3_NUM_64B_MB_	(14ul)
#define FLEXCAN3_64B_MBx(x)	(FLEXCAN3_MB_BASE_ +(x * 0x48ul))

#define FLEXCAN3_8B_MB0_	(FLEXCAN3_MB_BASE_ + 0x0000ul)
#define FLEXCAN3_8B_MB1_	(FLEXCAN3_MB_BASE_ + 0x0010ul)
#define FLEXCAN3_8B_MB2_	(FLEXCAN3_MB_BASE_ + 0x0020ul)
#define FLEXCAN3_8B_MB3_	(FLEXCAN3_MB_BASE_ + 0x0030ul)
#define FLEXCAN3_8B_MB4_	(FLEXCAN3_MB_BASE_ + 0x0040ul)
#define FLEXCAN3_8B_MB5_	(FLEXCAN3_MB_BASE_ + 0x0050ul)
#define FLEXCAN3_8B_MB6_	(FLEXCAN3_MB_BASE_ + 0x0060ul)
#define FLEXCAN3_8B_MB7_	(FLEXCAN3_MB_BASE_ + 0x0070ul)
#define FLEXCAN3_8B_MB8_	(FLEXCAN3_MB_BASE_ + 0x0080ul)
#define FLEXCAN3_8B_MB9_	(FLEXCAN3_MB_BASE_ + 0x0090ul)
#define FLEXCAN3_8B_MB10_	(FLEXCAN3_MB_BASE_ + 0x00A0ul)
#define FLEXCAN3_8B_MB11_	(FLEXCAN3_MB_BASE_ + 0x00B0ul)
#define FLEXCAN3_8B_MB12_	(FLEXCAN3_MB_BASE_ + 0x00C0ul)
#define FLEXCAN3_8B_MB13_	(FLEXCAN3_MB_BASE_ + 0x00D0ul)
#define FLEXCAN3_8B_MB14_	(FLEXCAN3_MB_BASE_ + 0x00E0ul)
#define FLEXCAN3_8B_MB15_	(FLEXCAN3_MB_BASE_ + 0x00F0ul)
#define FLEXCAN3_8B_MB16_	(FLEXCAN3_MB_BASE_ + 0x0100ul)
#define FLEXCAN3_8B_MB17_	(FLEXCAN3_MB_BASE_ + 0x0110ul)
#define FLEXCAN3_8B_MB18_	(FLEXCAN3_MB_BASE_ + 0x0120ul)
#define FLEXCAN3_8B_MB19_	(FLEXCAN3_MB_BASE_ + 0x0130ul)
#define FLEXCAN3_8B_MB20_	(FLEXCAN3_MB_BASE_ + 0x0140ul)
#define FLEXCAN3_8B_MB21_	(FLEXCAN3_MB_BASE_ + 0x0150ul)
#define FLEXCAN3_8B_MB22_	(FLEXCAN3_MB_BASE_ + 0x0160ul)
#define FLEXCAN3_8B_MB23_	(FLEXCAN3_MB_BASE_ + 0x0170ul)
#define FLEXCAN3_8B_MB24_	(FLEXCAN3_MB_BASE_ + 0x0180ul)
#define FLEXCAN3_8B_MB25_	(FLEXCAN3_MB_BASE_ + 0x0190ul)
#define FLEXCAN3_8B_MB26_	(FLEXCAN3_MB_BASE_ + 0x01A0ul)
#define FLEXCAN3_8B_MB27_	(FLEXCAN3_MB_BASE_ + 0x01B0ul)
#define FLEXCAN3_8B_MB28_	(FLEXCAN3_MB_BASE_ + 0x01C0ul)
#define FLEXCAN3_8B_MB29_	(FLEXCAN3_MB_BASE_ + 0x01D0ul)
#define FLEXCAN3_8B_MB30_	(FLEXCAN3_MB_BASE_ + 0x01E0ul)
#define FLEXCAN3_8B_MB31_	(FLEXCAN3_MB_BASE_ + 0x01F0ul)
#define FLEXCAN3_8B_MB32_	(FLEXCAN3_MB_BASE_ + 0x0200ul)
#define FLEXCAN3_8B_MB33_	(FLEXCAN3_MB_BASE_ + 0x0210ul)
#define FLEXCAN3_8B_MB34_	(FLEXCAN3_MB_BASE_ + 0x0220ul)
#define FLEXCAN3_8B_MB35_	(FLEXCAN3_MB_BASE_ + 0x0230ul)
#define FLEXCAN3_8B_MB36_	(FLEXCAN3_MB_BASE_ + 0x0240ul)
#define FLEXCAN3_8B_MB37_	(FLEXCAN3_MB_BASE_ + 0x0250ul)
#define FLEXCAN3_8B_MB38_	(FLEXCAN3_MB_BASE_ + 0x0260ul)
#define FLEXCAN3_8B_MB39_	(FLEXCAN3_MB_BASE_ + 0x0270ul)
#define FLEXCAN3_8B_MB40_	(FLEXCAN3_MB_BASE_ + 0x0280ul)
#define FLEXCAN3_8B_MB41_	(FLEXCAN3_MB_BASE_ + 0x0290ul)
#define FLEXCAN3_8B_MB42_	(FLEXCAN3_MB_BASE_ + 0x02A0ul)
#define FLEXCAN3_8B_MB43_	(FLEXCAN3_MB_BASE_ + 0x02B0ul)
#define FLEXCAN3_8B_MB44_	(FLEXCAN3_MB_BASE_ + 0x02C0ul)
#define FLEXCAN3_8B_MB45_	(FLEXCAN3_MB_BASE_ + 0x02D0ul)
#define FLEXCAN3_8B_MB46_	(FLEXCAN3_MB_BASE_ + 0x02E0ul)
#define FLEXCAN3_8B_MB47_	(FLEXCAN3_MB_BASE_ + 0x02F0ul)
#define FLEXCAN3_8B_MB48_	(FLEXCAN3_MB_BASE_ + 0x0300ul)
#define FLEXCAN3_8B_MB49_	(FLEXCAN3_MB_BASE_ + 0x0310ul)
#define FLEXCAN3_8B_MB50_	(FLEXCAN3_MB_BASE_ + 0x0320ul)
#define FLEXCAN3_8B_MB51_	(FLEXCAN3_MB_BASE_ + 0x0330ul)
#define FLEXCAN3_8B_MB52_	(FLEXCAN3_MB_BASE_ + 0x0340ul)
#define FLEXCAN3_8B_MB53_	(FLEXCAN3_MB_BASE_ + 0x0350ul)
#define FLEXCAN3_8B_MB54_	(FLEXCAN3_MB_BASE_ + 0x0360ul)
#define FLEXCAN3_8B_MB55_	(FLEXCAN3_MB_BASE_ + 0x0370ul)
#define FLEXCAN3_8B_MB56_	(FLEXCAN3_MB_BASE_ + 0x0380ul)
#define FLEXCAN3_8B_MB57_	(FLEXCAN3_MB_BASE_ + 0x0390ul)
#define FLEXCAN3_8B_MB58_	(FLEXCAN3_MB_BASE_ + 0x03A0ul)
#define FLEXCAN3_8B_MB59_	(FLEXCAN3_MB_BASE_ + 0x03B0ul)
#define FLEXCAN3_8B_MB60_	(FLEXCAN3_MB_BASE_ + 0x03C0ul)
#define FLEXCAN3_8B_MB61_	(FLEXCAN3_MB_BASE_ + 0x03D0ul)
#define FLEXCAN3_8B_MB62_	(FLEXCAN3_MB_BASE_ + 0x03E0ul)
#define FLEXCAN3_8B_MB63_	(FLEXCAN3_MB_BASE_ + 0x03F0ul)

// TODO: Verify these are correct. The datasheet appears to have a discrepancy on the offset of MB22
#define FLEXCAN3_16B_MB0_	(FLEXCAN3_MB_BASE_ + 0x0000ul)
#define FLEXCAN3_16B_MB1_	(FLEXCAN3_MB_BASE_ + 0x0018ul)
#define FLEXCAN3_16B_MB2_	(FLEXCAN3_MB_BASE_ + 0x0030ul)
#define FLEXCAN3_16B_MB3_	(FLEXCAN3_MB_BASE_ + 0x0048ul)
#define FLEXCAN3_16B_MB4_	(FLEXCAN3_MB_BASE_ + 0x0060ul)
#define FLEXCAN3_16B_MB5_	(FLEXCAN3_MB_BASE_ + 0x0078ul)
#define FLEXCAN3_16B_MB6_	(FLEXCAN3_MB_BASE_ + 0x0090ul)
#define FLEXCAN3_16B_MB7_	(FLEXCAN3_MB_BASE_ + 0x00A8ul)
#define FLEXCAN3_16B_MB8_	(FLEXCAN3_MB_BASE_ + 0x00C0ul)
#define FLEXCAN3_16B_MB9_	(FLEXCAN3_MB_BASE_ + 0x00D8ul)
#define FLEXCAN3_16B_MB10_	(FLEXCAN3_MB_BASE_ + 0x00F0ul)
#define FLEXCAN3_16B_MB11_	(FLEXCAN3_MB_BASE_ + 0x0108ul)
#define FLEXCAN3_16B_MB12_	(FLEXCAN3_MB_BASE_ + 0x0120ul)
#define FLEXCAN3_16B_MB13_	(FLEXCAN3_MB_BASE_ + 0x0138ul)
#define FLEXCAN3_16B_MB14_	(FLEXCAN3_MB_BASE_ + 0x0150ul)
#define FLEXCAN3_16B_MB15_	(FLEXCAN3_MB_BASE_ + 0x0168ul)
#define FLEXCAN3_16B_MB16_	(FLEXCAN3_MB_BASE_ + 0x0180ul)
#define FLEXCAN3_16B_MB17_	(FLEXCAN3_MB_BASE_ + 0x0198ul)
#define FLEXCAN3_16B_MB18_	(FLEXCAN3_MB_BASE_ + 0x01B0ul)
#define FLEXCAN3_16B_MB19_	(FLEXCAN3_MB_BASE_ + 0x01C8ul)
#define FLEXCAN3_16B_MB20_	(FLEXCAN3_MB_BASE_ + 0x01E0ul)
#define FLEXCAN3_16B_MB21_	(FLEXCAN3_MB_BASE_ + 0x01F8ul)
#define FLEXCAN3_16B_MB22_	(FLEXCAN3_MB_BASE_ + 0x0210ul)	// datasheet says the offset is 0x0218
#define FLEXCAN3_16B_MB23_	(FLEXCAN3_MB_BASE_ + 0x0228ul)
#define FLEXCAN3_16B_MB24_	(FLEXCAN3_MB_BASE_ + 0x0240ul)
#define FLEXCAN3_16B_MB25_	(FLEXCAN3_MB_BASE_ + 0x0258ul)
#define FLEXCAN3_16B_MB26_	(FLEXCAN3_MB_BASE_ + 0x0270ul)
#define FLEXCAN3_16B_MB27_	(FLEXCAN3_MB_BASE_ + 0x0288ul)
#define FLEXCAN3_16B_MB28_	(FLEXCAN3_MB_BASE_ + 0x02A0ul)
#define FLEXCAN3_16B_MB29_	(FLEXCAN3_MB_BASE_ + 0x02B8ul)
#define FLEXCAN3_16B_MB30_	(FLEXCAN3_MB_BASE_ + 0x02D0ul)
#define FLEXCAN3_16B_MB31_	(FLEXCAN3_MB_BASE_ + 0x02E8ul)
#define FLEXCAN3_16B_MB32_	(FLEXCAN3_MB_BASE_ + 0x0300ul)
#define FLEXCAN3_16B_MB33_	(FLEXCAN3_MB_BASE_ + 0x0318ul)
#define FLEXCAN3_16B_MB34_	(FLEXCAN3_MB_BASE_ + 0x0330ul)
#define FLEXCAN3_16B_MB35_	(FLEXCAN3_MB_BASE_ + 0x0348ul)
#define FLEXCAN3_16B_MB36_	(FLEXCAN3_MB_BASE_ + 0x0360ul)
#define FLEXCAN3_16B_MB37_	(FLEXCAN3_MB_BASE_ + 0x0378ul)
#define FLEXCAN3_16B_MB38_	(FLEXCAN3_MB_BASE_ + 0x0390ul)
#define FLEXCAN3_16B_MB39_	(FLEXCAN3_MB_BASE_ + 0x03A8ul)
#define FLEXCAN3_16B_MB40_	(FLEXCAN3_MB_BASE_ + 0x03C0ul)
#define FLEXCAN3_16B_MB41_	(FLEXCAN3_MB_BASE_ + 0x03D8ul)

// TODO: Verify these are correct. The datasheet appears to have a discrepancy on the offset of MB12
#define FLEXCAN3_32B_MB0_	(FLEXCAN3_MB_BASE_ + 0x0000ul)
#define FLEXCAN3_32B_MB1_	(FLEXCAN3_MB_BASE_ + 0x0028ul)
#define FLEXCAN3_32B_MB2_	(FLEXCAN3_MB_BASE_ + 0x0050ul)
#define FLEXCAN3_32B_MB3_	(FLEXCAN3_MB_BASE_ + 0x0078ul)
#define FLEXCAN3_32B_MB4_	(FLEXCAN3_MB_BASE_ + 0x00A0ul)
#define FLEXCAN3_32B_MB5_	(FLEXCAN3_MB_BASE_ + 0x00C8ul)
#define FLEXCAN3_32B_MB6_	(FLEXCAN3_MB_BASE_ + 0x00F0ul)
#define FLEXCAN3_32B_MB7_	(FLEXCAN3_MB_BASE_ + 0x0118ul)
#define FLEXCAN3_32B_MB8_	(FLEXCAN3_MB_BASE_ + 0x0140ul)
#define FLEXCAN3_32B_MB9_	(FLEXCAN3_MB_BASE_ + 0x0168ul)
#define FLEXCAN3_32B_MB10_	(FLEXCAN3_MB_BASE_ + 0x0190ul)
#define FLEXCAN3_32B_MB11_	(FLEXCAN3_MB_BASE_ + 0x01B8ul)
#define FLEXCAN3_32B_MB12_	(FLEXCAN3_MB_BASE_ + 0x01E0ul) // datasheet says the offset is 0x0200
#define FLEXCAN3_32B_MB13_	(FLEXCAN3_MB_BASE_ + 0x0208ul)
#define FLEXCAN3_32B_MB14_	(FLEXCAN3_MB_BASE_ + 0x0230ul)
#define FLEXCAN3_32B_MB15_	(FLEXCAN3_MB_BASE_ + 0x0258ul)
#define FLEXCAN3_32B_MB16_	(FLEXCAN3_MB_BASE_ + 0x0280ul)
#define FLEXCAN3_32B_MB17_	(FLEXCAN3_MB_BASE_ + 0x02A8ul)
#define FLEXCAN3_32B_MB18_	(FLEXCAN3_MB_BASE_ + 0x02D0ul)
#define FLEXCAN3_32B_MB19_	(FLEXCAN3_MB_BASE_ + 0x02F8ul)
#define FLEXCAN3_32B_MB20_	(FLEXCAN3_MB_BASE_ + 0x0320ul)
#define FLEXCAN3_32B_MB21_	(FLEXCAN3_MB_BASE_ + 0x0348ul)
#define FLEXCAN3_32B_MB22_	(FLEXCAN3_MB_BASE_ + 0x0370ul)
#define FLEXCAN3_32B_MB23_	(FLEXCAN3_MB_BASE_ + 0x0398ul)

// TODO: Verify these are correct. The datasheet appears to have a discrepancy on the offset of MB7
#define FLEXCAN3_64B_MB0_	(FLEXCAN3_MB_BASE_ + 0x0000ul)
#define FLEXCAN3_64B_MB1_	(FLEXCAN3_MB_BASE_ + 0x0048ul)
#define FLEXCAN3_64B_MB2_	(FLEXCAN3_MB_BASE_ + 0x0090ul)
#define FLEXCAN3_64B_MB3_	(FLEXCAN3_MB_BASE_ + 0x00D8ul)
#define FLEXCAN3_64B_MB4_	(FLEXCAN3_MB_BASE_ + 0x0120ul)
#define FLEXCAN3_64B_MB5_	(FLEXCAN3_MB_BASE_ + 0x0168ul)
#define FLEXCAN3_64B_MB6_	(FLEXCAN3_MB_BASE_ + 0x01B0ul)
#define FLEXCAN3_64B_MB7_	(FLEXCAN3_MB_BASE_ + 0x01F8ul)	// datasheet says the offset is 0x0200
#define FLEXCAN3_64B_MB8_	(FLEXCAN3_MB_BASE_ + 0x0240ul)
#define FLEXCAN3_64B_MB9_	(FLEXCAN3_MB_BASE_ + 0x0288ul)
#define FLEXCAN3_64B_MB10_	(FLEXCAN3_MB_BASE_ + 0x02D0ul)
#define FLEXCAN3_64B_MB11_	(FLEXCAN3_MB_BASE_ + 0x0318ul)
#define FLEXCAN3_64B_MB12_	(FLEXCAN3_MB_BASE_ + 0x0360ul)
#define FLEXCAN3_64B_MB13_	(FLEXCAN3_MB_BASE_ + 0x03A8ul)

// Receiving Individual Mask Registers  (R/W)
#define FLEXCAN3_RXIMRx(x)	(FLEXCAN3_BASE_ + 0x0880ul +(x * 0x4ul))

#define FLEXCAN3_RXIMR0_	(FLEXCAN3_BASE_ + 0x0880ul)
#define FLEXCAN3_RXIMR1_	(FLEXCAN3_BASE_ + 0x0884ul)
#define FLEXCAN3_RXIMR2_	(FLEXCAN3_BASE_ + 0x0888ul)
#define FLEXCAN3_RXIMR3_	(FLEXCAN3_BASE_ + 0x088Cul)
#define FLEXCAN3_RXIMR4_	(FLEXCAN3_BASE_ + 0x0890ul)
#define FLEXCAN3_RXIMR5_	(FLEXCAN3_BASE_ + 0x0894ul)
#define FLEXCAN3_RXIMR6_	(FLEXCAN3_BASE_ + 0x0898ul)
#define FLEXCAN3_RXIMR7_	(FLEXCAN3_BASE_ + 0x089Cul)
#define FLEXCAN3_RXIMR8_	(FLEXCAN3_BASE_ + 0x08A0ul)
#define FLEXCAN3_RXIMR9_	(FLEXCAN3_BASE_ + 0x08A4ul)
#define FLEXCAN3_RXIMR10_	(FLEXCAN3_BASE_ + 0x08A8ul)
#define FLEXCAN3_RXIMR11_	(FLEXCAN3_BASE_ + 0x08ACul)
#define FLEXCAN3_RXIMR12_	(FLEXCAN3_BASE_ + 0x08B0ul)
#define FLEXCAN3_RXIMR13_	(FLEXCAN3_BASE_ + 0x08B4ul)
#define FLEXCAN3_RXIMR14_	(FLEXCAN3_BASE_ + 0x08B8ul)
#define FLEXCAN3_RXIMR15_	(FLEXCAN3_BASE_ + 0x08BCul)
#define FLEXCAN3_RXIMR16_	(FLEXCAN3_BASE_ + 0x08C0ul)
#define FLEXCAN3_RXIMR17_	(FLEXCAN3_BASE_ + 0x08C4ul)
#define FLEXCAN3_RXIMR18_	(FLEXCAN3_BASE_ + 0x08C8ul)
#define FLEXCAN3_RXIMR19_	(FLEXCAN3_BASE_ + 0x08CCul)
#define FLEXCAN3_RXIMR20_	(FLEXCAN3_BASE_ + 0x08D0ul)
#define FLEXCAN3_RXIMR21_	(FLEXCAN3_BASE_ + 0x08D4ul)
#define FLEXCAN3_RXIMR22_	(FLEXCAN3_BASE_ + 0x08D8ul)
#define FLEXCAN3_RXIMR23_	(FLEXCAN3_BASE_ + 0x08DCul)
#define FLEXCAN3_RXIMR24_	(FLEXCAN3_BASE_ + 0x08E0ul)
#define FLEXCAN3_RXIMR25_	(FLEXCAN3_BASE_ + 0x08E4ul)
#define FLEXCAN3_RXIMR26_	(FLEXCAN3_BASE_ + 0x08E8ul)
#define FLEXCAN3_RXIMR27_	(FLEXCAN3_BASE_ + 0x08ECul)
#define FLEXCAN3_RXIMR28_	(FLEXCAN3_BASE_ + 0x08F0ul)
#define FLEXCAN3_RXIMR29_	(FLEXCAN3_BASE_ + 0x08F4ul)
#define FLEXCAN3_RXIMR30_	(FLEXCAN3_BASE_ + 0x08F8ul)
#define FLEXCAN3_RXIMR31_	(FLEXCAN3_BASE_ + 0x08FCul)
#define FLEXCAN3_RXIMR32_	(FLEXCAN3_BASE_ + 0x0900ul)
#define FLEXCAN3_RXIMR33_	(FLEXCAN3_BASE_ + 0x0904ul)
#define FLEXCAN3_RXIMR34_	(FLEXCAN3_BASE_ + 0x0908ul)
#define FLEXCAN3_RXIMR35_	(FLEXCAN3_BASE_ + 0x090Cul)
#define FLEXCAN3_RXIMR36_	(FLEXCAN3_BASE_ + 0x0910ul)
#define FLEXCAN3_RXIMR37_	(FLEXCAN3_BASE_ + 0x0914ul)
#define FLEXCAN3_RXIMR38_	(FLEXCAN3_BASE_ + 0x0918ul)
#define FLEXCAN3_RXIMR39_	(FLEXCAN3_BASE_ + 0x091Cul)
#define FLEXCAN3_RXIMR40_	(FLEXCAN3_BASE_ + 0x0920ul)
#define FLEXCAN3_RXIMR41_	(FLEXCAN3_BASE_ + 0x0924ul)
#define FLEXCAN3_RXIMR42_	(FLEXCAN3_BASE_ + 0x0928ul)
#define FLEXCAN3_RXIMR43_	(FLEXCAN3_BASE_ + 0x092Cul)
#define FLEXCAN3_RXIMR44_	(FLEXCAN3_BASE_ + 0x0930ul)
#define FLEXCAN3_RXIMR45_	(FLEXCAN3_BASE_ + 0x0934ul)
#define FLEXCAN3_RXIMR46_	(FLEXCAN3_BASE_ + 0x0938ul)
#define FLEXCAN3_RXIMR47_	(FLEXCAN3_BASE_ + 0x093Cul)
#define FLEXCAN3_RXIMR48_	(FLEXCAN3_BASE_ + 0x0940ul)
#define FLEXCAN3_RXIMR49_	(FLEXCAN3_BASE_ + 0x0944ul)
#define FLEXCAN3_RXIMR50_	(FLEXCAN3_BASE_ + 0x0948ul)
#define FLEXCAN3_RXIMR51_	(FLEXCAN3_BASE_ + 0x094Cul)
#define FLEXCAN3_RXIMR52_	(FLEXCAN3_BASE_ + 0x0950ul)
#define FLEXCAN3_RXIMR53_	(FLEXCAN3_BASE_ + 0x0954ul)
#define FLEXCAN3_RXIMR54_	(FLEXCAN3_BASE_ + 0x0958ul)
#define FLEXCAN3_RXIMR55_	(FLEXCAN3_BASE_ + 0x095Cul)
#define FLEXCAN3_RXIMR56_	(FLEXCAN3_BASE_ + 0x0960ul)
#define FLEXCAN3_RXIMR57_	(FLEXCAN3_BASE_ + 0x0964ul)
#define FLEXCAN3_RXIMR58_	(FLEXCAN3_BASE_ + 0x0968ul)
#define FLEXCAN3_RXIMR59_	(FLEXCAN3_BASE_ + 0x096Cul)
#define FLEXCAN3_RXIMR60_	(FLEXCAN3_BASE_ + 0x0970ul)
#define FLEXCAN3_RXIMR61_	(FLEXCAN3_BASE_ + 0x0974ul)
#define FLEXCAN3_RXIMR62_	(FLEXCAN3_BASE_ + 0x0978ul)
#define FLEXCAN3_RXIMR63_	(FLEXCAN3_BASE_ + 0x097Cul)

// CAN FD Control Register (R/W)
#define FLEXCAN3_FDCTRL_	(FLEXCAN3_BASE_ + 0x0C00ul)
// CAN FD Bit Timing Register (R/W)
#define FLEXCAN3_FDCBT_		(FLEXCAN3_BASE_ + 0x0C04ul)
// CAN FD CRC Register (Read Only)
#define FLEXCAN3_FDCRC_		(FLEXCAN3_BASE_ + 0x0C08ul)

#pragma endregion // BASE REGISTERS

/**********\ REGISTER INFO  /**********/
#pragma region REGISTER INFO

