Pandabear1125/BuffCAN/src/imxrt1062_registers.h
/// Receiving Mailboxes Global Mask Register - FLEXCAN3_RXMGMASK - (R/W)
#define FLEXCAN3_RXMGMASK_MASK			(0xFFFFFFFFul << 0ul) 	// 32 bits

/// Receiving 14 Mask Register - FLEXCAN3_RX14MASK - (R/W)
#define FLEXCAN3_RX14MASK_MASK			(0xFFFFFFFFul << 0ul) 	// 32 bits

/// Receiving 15 Mask Register - FLEXCAN3_RX15MASK - (R/W)
#define FLEXCAN3_RX15MASK_MASK			(0xFFFFFFFFul << 0ul) 	// 32 bits

/// Error Counter - FLEXCAN3_ECR - (R/W)
#define FLEXCAN3_ECR_RX_ERR_CNT_FAST	(0xFFul << 24ul)		// 8 bits
#define FLEXCAN3_ECR_TX_ERR_CNT_FAST	(0xFFul << 16ul)		// 8 bits
#define FLEXCAN3_ECR_RX_ERR_CNT			(0xFFul << 8ul)			// 8 bits
#define FLEXCAN3_ECR_TX_ERR_CNT			(0xFFul << 0ul)			// 8 bits

/// Error and Status 1 Register - FLEXCAN3_ESR1 - (Read Clears Register)
#define FLEXCAN3_ESR1_BIT1_ERR_FAST		(0x1ul << 31ul) 		// 1 bit
#define FLEXCAN3_ESR1_BIT0_ERR_FAST		(0x1ul << 30ul) 		// 1 bit
// reserved 29
#define FLEXCAN3_ESR1_CRC_ERR_FAST 		(0x1ul << 28ul) 		// 1 bit
#define FLEXCAN3_ESR1_FRM_ERR_FAST		(0x1ul << 27ul) 		// 1 bit
#define FLEXCAN3_ESR1_STF_ERR_FAST		(0x1ul << 26ul) 		// 1 bit
// reserved 25 - 22
#define FLEXCAN3_ESR1_ERR_OVR 			(0x1ul << 21ul) 		// 1 bit
#define FLEXCAN3_ESR1_ERR_INT_FAST		(0x1ul << 20ul) 		// 1 bit
#define FLEXCAN3_ESR1_BOFF_DONE_INT		(0x1ul << 19ul) 		// 1 bit
#define FLEXCAN3_ESR1_SYNCH				(0x1ul << 18ul) 		// 1 bit
#define FLEXCAN3_ESR1_TWRN_INT 			(0x1ul << 17ul) 		// 1 bit
#define FLEXCAN3_ESR1_RWRN_INT 			(0x1ul << 16ul) 		// 1 bit
#define FLEXCAN3_ESR1_BIT1_ERR 			(0x1ul << 15ul) 		// 1 bit
#define FLEXCAN3_ESR1_BIT0_ERR 			(0x1ul << 14ul) 		// 1 bit
#define FLEXCAN3_ESR1_ACK_ERR 			(0x1ul << 13ul) 		// 1 bit
#define FLEXCAN3_ESR1_CRC_ERR 			(0x1ul << 12ul) 		// 1 bit
#define FLEXCAN3_ESR1_FRM_ERR 			(0x1ul << 11ul) 		// 1 bit
#define FLEXCAN3_ESR1_STF_ERR 			(0x1ul << 10ul) 		// 1 bit
#define FLEXCAN3_ESR1_TX_WRN 			(0x1ul << 9ul)			// 1 bit
#define FLEXCAN3_ESR1_RX_WRN 			(0x1ul << 8ul)			// 1 bit
#define FLEXCAN3_ESR1_IDLE 				(0x1ul << 7ul)			// 1 bit
#define FLEXCAN3_ESR1_TX 				(0x1ul << 6ul)			// 1 bit
#define FLEXCAN3_ESR1_FLT_CONF 			(0x3ul << 4ul)			// 2 bits
#define FLEXCAN3_ESR1_RX 				(0x1ul << 3ul)			// 1 bit
#define FLEXCAN3_ESR1_BOFF_INT 			(0x1ul << 2ul)			// 1 bit
#define FLEXCAN3_ESR1_ERR_INT 			(0x1ul << 1ul)			// 1 bit
#define FLEXCAN3_ESR1_WAK_INT 			(0x1ul << 0ul)			// 1 bit

/// Interrupt Masks 2 Register - FLEXCAN3_IMASK2 - (R/W)
#define FLEXCAN3_IMASK2_MASK			(0xFFFFFFFFul << 0ul) 	// 32 bits

/// Interrupt Masks 1 Register - FLEXCAN3_IMASK1 - (R/W)
#define FLEXCAN3_IMASK1_MASK			(0xFFFFFFFFul << 0ul) 	// 32 bits

/// Interrupt Flags 2 Register - FLEXCAN3_IFLAG2 - (R/W - Write 1s to clear)
#define FLEXCAN3_IFLAG2_MASK			(0xFFFFFFFFul << 0ul) 	// 32 bits

/// Interrupt Flags 1 Register - FLEXCAN3_IFLAG1 - (R/W - Write 1s to clear)
#define FLEXCAN3_IFLAG1_BUF31TO8		(0xFFFFFFul << 8ul) 	// 24 bits
#define FLEXCAN3_IFLAG1_BUF7			(0x1ul << 7ul)			// 1 bit
#define FLEXCAN3_IFLAG1_BUF6			(0x1ul << 6ul)			// 1 bit
#define FLEXCAN3_IFLAG1_BUF5			(0x1ul << 5ul)			// 1 bit
#define FLEXCAN3_IFLAG1_BUF4TO1			(0xFul << 1ul)			// 4 bits
#define FLEXCAN3_IFLAG1_BUF0			(0x1ul << 0ul)			// 1 bit

/// Control 2 Register - FLEXCAN3_CTRL2 - (R/W)
#define FLEXCAN3_CTRL2_ERR_MSK_FAST		(0x1ul << 31ul) 		// 1 bit
#define FLEXCAN3_CTRL2_BOFF_DONE_MSK	(0x1ul << 30ul) 		// 1 bit
// reserved 29 - 28
#define FLEXCAN3_CTRL2_RF_EN			(0xFul << 24ul)			// 4 bits
#define FLEXCAN3_CTRL2_TASD				(0x1Ful << 19ul)		// 5 bits
#define FLEXCAN3_CTRL2_MRP				(0x1ul << 18ul)			// 1 bit
#define FLEXCAN3_CTRL2_RRS				(0x1ul << 17ul)			// 1 bit
#define FLEXCAN3_CTRL2_EAC_EN			(0x1ul << 16ul)			// 1 bit
#define FLEXCAN3_CTRL2_TIMER_SRC		(0x1ul << 15ul)			// 1 bit
#define FLEXCAN3_CTRL2_PPEXC_EN			(0x1ul << 14ul)			// 1 bit
// reserved 13
#define FLEXCAN3_CTRL2_ISO_CAN_FD_EN	(0x1ul << 12ul)			// 1 bit
#define FLEXCAN3_CTRL2_EDFLT_DIS		(0x1ul << 11ul)			// 1 bit
// reserved 10 - 0

/// Error and Status 2 Register - FLEXCAN3_ESR2 - (Read Clears Register)
// reserved 31 - 23
#define FLEXCAN3_ESR2_LPTM				(0x7Ful << 16ul)		// 7 bits
// reserved 15
#define FLEXCAN3_ESR2_VPS				(0x1ul << 14ul)			// 1 bit
#define FLEXCAN3_ESR2_IMB				(0x1ul << 13ul)			// 1 bit
// reserved 12 - 0

/// CRC Register - FLEXCAN3_CRCR - (R/W)
// reserved 31 - 23
#define FLEXCAN3_CRCR_MBCRC				(0x7Ful << 16ul)		// 7 bits
// reserved 15
#define FLEXCAN3_CRCR_TXCRC				(0x7FFFul << 0ul)		// 15 bits

/// Rx FIFO Global Mask Register - FLEXCAN3_RXFGMASK - (R/W)
#define FLEXCAN3_RXFGMASK_MASK			(0xFFFFFFFFul << 0ul) 	// 32 bits

/// Rx FIFO Information Register - FLEXCAN3_RXFIR - (Read Only)
// reserved 31 - 9
#define FLEXCAN3_RXFIR_IDHIT			(0x1FFul << 0ul)		// 9 bits

/// CAN Bit Timing Register - FLEXCAN3_CBT - (R/W)
#define FLEXCAN3_CBT_BTF				(0x1ul << 31ul)			// 1 bit
#define FLEXCAN3_CBT_EPRESDIV			(0x3FFul << 21ul)		// 10 bits
#define FLEXCAN3_CBT_ERJW				(0x1Ful << 16ul)		// 5 bits
#define FLEXCAN3_CBT_EPROPSEG			(0x3Ful << 10ul)		// 6 bits
#define FLEXCAN3_CBT_EPSEG1				(0x1Ful << 5ul)			// 5 bits
#define FLEXCAN3_CBT_EPSEG2				(0x1Ful << 0ul)			// 5 bits

/// Rx Individual Mask Registers - FLEXCAN3_RXIMRn - (R/W)
#define FLEXCAN3_RXIMR_MASK				(0xFFFFFFFFul << 0ul) 	// 32 bits

/// CAN FD Control Register - FLEXCAN3_FDCTRL - (R/W)
#define FLEXCAN3_FDCTRL_FD_RATE			(0x1ul << 31ul)			// 1 bit
// reserved 30 - 21
#define FLEXCAN3_FDCTRL_MBDSR1			(0x3ul << 19ul)			// 2 bits
// reserved 18
#define FLEXCAN3_FDCTRL_MBDSR0			(0x3ul << 16ul)			// 2 bits
#define FLEXCAN3_FDCTRL_TDC_EN			(0x1ul << 15ul)			// 1 bit
#define FLEXCAN3_FDCTRL_TDCFAIL			(0x1ul << 14ul)			// 1 bit
// reserved 13
#define FLEXCAN3_FDCTRL_TDC_OFF			(0x1Ful << 8ul)			// 5 bits
// reserved 7 - 6
#define FLEXCAN3_FDCTRL_TDCVAL			(0x3Ful << 0ul)			// 6 bits

/// CAN FD Bit Timing Register - FLEXCAN3_FDCBT - (R/W)
// reserved 31 - 30
#define FLEXCAN3_FDCBT_FPRESDIV			(0x3FFul << 20ul)		// 10 bits
// reserved 19
#define FLEXCAN3_FDCBT_FRJW				(0x7ul << 16ul)			// 3 bits
// reserved 15
#define FLEXCAN3_FDCBT_FPROPSEG			(0x1Ful << 10ul)		// 5 bits
// reserved 9 - 8
#define FLEXCAN3_FDCBT_FPSEG1			(0x7ul << 5ul)			// 3 bits
// reserved 4 - 3
#define FLEXCAN3_FDCBT_FPSEG2			(0x7ul << 0ul)			// 3 bits

/// CAN FD CRC Register - FLEXCAN3_FDCRC - (R/W)
// reserved 31
#define FLEXCAN3_FDCRC_MBCRC			(0x7Ful << 24ul)		// 7 bits
// reserved 23 - 21
#define FLEXCAN3_FDCRC_TXCRC			(0xFFFFFul << 0ul)		// 20 bits


#pragma endregion

#endif// BUFFCAN_IMXRT1062_REGISTERS_HPP